{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Embedding","config":{"input_dim":20000,"output_dim":128,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false,"input_length":null,"name":"embedding_1","trainable":true,"batch_input_shape":[null,null],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_1","trainable":true}},{"class_name":"Conv1D","config":{"filters":250,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_1","trainable":true}},{"class_name":"GlobalMaxPooling1D","config":{"name":"global_max_pooling1d_1","trainable":true}},{"class_name":"Dense","config":{"units":250,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_2","trainable":true}}]},"keras_version":"tfjs-layers 2.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.7.0","convertedBy":null,"weightsManifest":[{"paths":["./extractedModel.weights.bin"],"weights":[{"name":"embedding_1/embeddings","shape":[20000,128],"dtype":"float32"},{"name":"conv1d_1/kernel","shape":[3,128,250],"dtype":"float32"},{"name":"conv1d_1/bias","shape":[250],"dtype":"float32"},{"name":"dense_1/kernel","shape":[250,250],"dtype":"float32"},{"name":"dense_1/bias","shape":[250],"dtype":"float32"},{"name":"dense_2/kernel","shape":[250,1],"dtype":"float32"},{"name":"dense_2/bias","shape":[1],"dtype":"float32"}]}]}